IDEA Open Model
WeldType Enumeration
Compatible with IDEA StatiCa v 10.1
 Represents the code of the position
 Namespace: IdeaRS.OpenModel.Parameters
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 10.1.0.1 (10.1.0.1)
Syntax
public enum WeldType
Public Enumeration WeldType
public enum class WeldType
Members
Member name | Value | Description
None | 0 |  No weld
LeftFillet | 1 |  Fillet weld is on the left side
RightFillet | 2 |  Fillet weld on the right side
DoubleFillet | 3 |  Fillet weld on both sides (double fillet)
Bevel | 4 |  Bevel weld
See Also
Reference
IdeaRS.OpenModel.Parameters Namespace